package module2.data;

import module2.model.Book;

import java.util.Arrays;
import java.util.List;

// Класс для предоставления данных о книгах
public class BookData {

    /*
    Предоставляет список предопределенных уникальных объектов Book.
    Содержит как русскую, так и зарубежную литературу.
    @return Список объектов Book.
     */

    public static List<Book> getAllBooks() {
        return Arrays.asList(
                new Book("Преступление и наказание", "Фёдор Достоевский", 600, 1866),
                new Book("Война и мир", "Лев Толстой", 1225, 1869),
                new Book("Мастер и Маргарита", "Михаил Булгаков", 400, 1967),
                new Book("Евгений Онегин", "Александр Пушкин", 200, 1833),
                new Book("Герой нашего времени", "Михаил Лермонтов", 350, 1840),
                new Book("The Lord of the Rings", "J.R.R. Tolkien", 1178, 1954),
                new Book("Pride and Prejudice", "Jane Austen", 432, 1813),
                new Book("The Alchemist", "Paulo Coelho", 208, 1988),
                new Book("1984", "George Orwell", 328, 1949),
                new Book("Гарри Поттер и философский камень", "Джоан Роулинг", 432, 1997),
                new Book("Гарри Поттер и тайная комната", "Джоан Роулинг", 341, 1998),
                new Book("Анна Каренина", "Лев Толстой", 864, 1877),
                new Book("Собачье сердце", "Михаил Булгаков", 160, 1987),
                new Book("Три товарища", "Эрих Мария Ремарк", 480, 1936),
                new Book("Маленький принц", "Антуан де Сент-Экзюпери", 96, 1943),
                new Book("Шерлок Холмс", "Артур Конан Дойл", 688, 1892),
                new Book("The Hobbit", "J.R.R. Tolkien", 328, 1937),
                new Book("The Catcher in the Rye", "J.D. Salinger", 234, 1951),
                new Book("Божественная комедия", "Данте Алигьери", 600, 1472),
                new Book("Идиот", "Фёдор Достоевский", 650, 1869),
                new Book("Тихий Дон", "Михаил Шолохов", 800, 1928),
                new Book("Белая гвардия", "Михаил Булгаков", 320, 1925),
                new Book("Двенадцать стульев", "Илья Ильф и Евгений Петров", 400, 1928),
                new Book("Золотой теленок", "Илья Ильф и Евгений Петров", 480, 1931),
                new Book("Маленькая жизнь", "Ханья Янагихара", 832, 2015),
                new Book("Щегол", "Донна Тартт", 864, 2013),
                new Book("Норвежский лес", "Харуки Мураками", 384, 1987),
                new Book("Убить пересмешника", "Харпер Ли", 384, 2015),
                new Book("Хроники Нарнии: Лев, колдунья и платяной шкаф", "Клайв С. Льюис", 208, 1950),
                new Book("О дивный новый мир", "Олдос Хаксли", 311, 1932)
        );
    }
}